#+TITLE: BSU
#+AUTHOR: Justin Johnson

*BOLD*
_UNDERLINE_
=VERBATIM=
~CODE~
/ITALIC/

** INPROGRESS Consult Advisor to finalize Spring schedule
   SCHEDULED: <2018-10-22 Mon 10:00>
   :PROPERTIES:
   :ARCHIVE_TIME: 2018-11-12 Mon 12:09
   :ARCHIVE_FILE: ~/.emacs.d/Notebooks/BSU.org
   :ARCHIVE_OLPATH: Spring2019 Registration Prep/Spring 2019 Plan
   :ARCHIVE_CATEGORY: BSU
   :ARCHIVE_TODO: INPROGRESS
   :END:
   | Course    | Description                         | Credits | Instructors            |
   |-----------+-------------------------------------+---------+------------------------|
   | UF 200    | Foundations of Ethics and Diversity |       3 |                        |
   | CS 361    | Intro to Theory of Comp             |       3 |                        |
   | CS 441    | Computer Architecture               |       3 |                        |
   | CS 453    | Operating Systems                   |       3 | Shane Panter/Amit jain |
   | CS-HU 271 | Agile Developement                  |       1 |                        |
   | ***         | Work U                              |      3  |                        |
   | ^         | Total:                              |      13 |                        |
   #+TBLFM: $3=vsum(@2..@-1)
******** Attack
#+NAME: Why it works (Partial Key Exposure Attack Proof)
#+BEGIN_EXAMPLE 
Ex1:	
	5 = 2 mod 3
	5 = 1*3 + 2
Ex2:
	17 = 2 mod 3
	17 = 5*3 + 2
Ex3:
	d = e mod n
	d = n*k + e :for some k

d 	= 1/e mod phi(n)
d*e = 1 mod phi(n)
e*d	= k*phi(n) + 1
UNKNOWNS:	phi(n),k,d
KNOWNS:		n,e
"Well-Known" AM-GM inequality shows:
	2sqrt(xy) <= x + y
! This can be used to approximate phi(n)
	phi(n) 	= (p-1)(q-1)
			= pq - (p+q) + 1 <= pq - 2sqrt(pq) + 1
			<= n - 2sqrt(n) + 1
			*Note equality sign flipped by mult. of -1
	e*dk	= k*phi(n) + 1 //where Dk is smoe approximation of d (private key)
		therefore
	*For k < d define:
	Dk 		= (k*phi(n) + 1)/e //note that phi(n) is our approximation as shown above
	
	if we have the last m digits of d, (Least significant portion), we can
	substitute L (least significant portion) to improve our approximation
	of Dk by replacing the LSD (Least Significant Digits) of Dk with L.
	
#+END_EXAMPLE

#+NAME:  Partial Key Exposure Attack
#+BEGIN_SRC sage
########################################################################################
# The function takes in the requested inputs and computes a decryption key             #
# If there are not enough digits in the input the function will tell you so            #
########################################################################################

def partial (R, e, partd):
    m = 1000
    E = m.powermod(e,R)#&^(m, s) % R
    for k in range(1, e * 10000):
        Dk = math.floor((k * (R - 2 * isqrt(R) + 1) + 1) / e)
        l=(partd).ndigits()
        Dk=Dk-(Dk % 10^l)+partd
        mm = E.powermod(Dk,R)#E&^Dk mod R:
        if m == mm:
            return(Dk)
    print("not enough digits to discover d")

R=1030794365305576815134103206958049837943419896523;
e=17873;
partd=6816907735531628355014100526810177;
Dd=partial(R,e,partd);
Dd

p = next_prime(776213649127364987123648972364987123648972316498623197124356715324065713526)
q = next_prime(2345545654565456654512374619287364981723648972163984612983461912386)
N = p*q
phiN = (p-1)*(q-1)
e = 17
e
while gcd(e,phiN)!=1: e+=1
d = 1/e % phiN
d
partialD = 1452930806742028080905133750698038297318124171383735131021465946217038961017925194270324213877445652376073
Dd=partial(N,e,partialD);
Dd
#+END_SRC

#+RESULTS: Partial Key Exposure Attack
: not enough digits to discover d
: 17
: 749677168357388769334958802538629561452930806742028080905133750698038297318124171383735131021465946217038961017925194270324213877445652376073
: not enough digits to discover d

******* Example
#+NAME: CRT
#+HEADER: :tangle ./src/sage/crt.sage
#+BEGIN_SRC sage
#################################################################################################
# The input is a number and the output is the original message. If the input is not padded ASCII#
# version of a message it returns the value: "This is not a padded ASCII string"                #
#################################################################################################
def ASCIIDepad(Number):
    ndigits=len(str(Number))
    n = ndigits % 3
    if (n > 0):
        print("This is not a padded ASCII string\n")
    else:
        L = [((Number - (Number % (1000^i)))/1000^i)%1000 - 100 for i in range(Number.ndigits()/3)]
        N = ""
        for i in range(Number.ndigits()/3):
            N = chr(L[i]) + N
        return(N)

b=[
17089298199140245689054146396696610382482599563869128220501355545433181167922449,
647456570985467791350694143163125775416153692645317710289110387858313344490925,
1571157443614188818570414758920219335869445581270513124197983268054945711653,
8680494616758492300153857128626182886244875669712992627620622363379875255673298873890889, 
3740176144174317705113182325751346003703203506734421120250951010374481407984708481673873
]
# encryption canNOT be larger than the modulus
n=[
138167915492481816745409346812614907970213601388948993432404324912548722779337539,
689234730968542058710415199123628060022111911748855188203650454001478717930441,
165927789907443292785652054606917804467309174081946624778696246358960638705571,
9707030033411217539906954498964338207893718488045203990403325340285676761140144260245667,
9702513696679623002778707839853209062395283481756367743103770927153046936810417007760591
]

e=5
x = crt(b,n); x
M=x.nth_root(e)
M=ASCIIDepad(M)
M
#+END_SRC

#+RESULTS: CRT
: 179702189046065030137840983877506282733808216772222487872385030013418159775151368010537808270369776111280249922696184622250812210618422156974500421843302635815511055022781078203555271102862470424542573876078160729973527171345068730365265430297970391004390643094550260335823552446001
: 'Next hack DigiCrime'

****** ATTACKS: ISATTACK
#+NAME: InitialSegment Attack Small q
#+BEGIN_SRC sage
def ISAttack (R):
    n = R.ndigits()
    #n = len(R)
    for j in range(1, n + 1):
        x=(R-(R % 10^j))/10^j
        p = gcd(x, R)
        if ((1 < p)and (p<R)):
            return(p)
    print "nonefound"

# Choose large prime with many consecutive zeros
p=next_prime(1213000000000000000000000000000000000000000000000000000000000000124)
p
# Choose prime with less digits than p has zeros
q=next_prime(1234567890)
q
# COmputer n=p*q
n=p*q
n
# Apply ISAttack
p=ISAttack(n)
p
#+END_SRC
#+RESULTS: InitialSegment Attack
: 1213000000000000000000000000000000000000000000000000000000000000291
: 1234567891
: 1497530851783000000000000000000000000000000000000000000000000000359259256281
: 1234567891

#+NAME: InitialSegment Large q
#+BEGIN_SRC sage
def ISAttack (R):
    n = R.ndigits()
    #n = len(R)
    for j in range(1, n + 1):
        x=(R-(R % 10^j))/10^j
        p = gcd(x, R)
        if ((1 < p)and (p<R)):
            return(p)
    print "nonefound"

# Choose large prime p with many consecutive zeros
p=next_prime(1000000000000000000000000000002347239472938749237492837498237984237987237498792831)
p
# Choose large q
q=next_prime(196327349823794238791247612374689213649218736498)
q
# Compute n=p*q
n=p*q
n
p=ISAttack(n)
p
#+END_SRC
#+RESULTS: InitialSegment Large q
: 1000000000000000000000000000002347239472938749237492837498237984237987237498793079
: 196327349823794238791247612374689213649218736623
: 196327349823794238791247612375150040954342600855043086369924757982661461133718474657040466537331025478920476913721120235676232217
: nonefound
***** Example
#+NAME: Diffie-Hellman
#+BEGIN_SRC sage
def Dirichlet (q):
    j=0
    #for j in numpy.arange(0.10e1, infinity + 0.10e1, 0.10e1):
    while True:
        j+=1
        p = 2 * j * q + 1
        if is_prime(p) == True:
            return(p)

def findLargePrimitiveRoot(n,p):
    n=n+1
    eulerp = euler_phi(p)
    Q = list(factor(eulerp))
    while n<p:
        found = True
        for Q2 in Q:
            q=Q2[0]
            totest = power_mod(ZZ(n),ZZ(eulerp/q),ZZ(p)) 
#            print(totest)
            if totest==1:
                found = False
        if found:
            return n
        n+=1

# (1) Choose a large prime p
# REF: https://stackoverflow.com/a/34141119
p=random_prime(10**150,10**160)
p
# (2) Choose a primitive root Q of P
# 	- the smalles number k such that Q^k mod P = 1 is (p-1)
# REF: http://doc.sagemath.org/html/en/prep/Quickstarts/Number-Theory.html
#q=mod(primitive_root(p),p)
#q

#a=randint(1,p) # Alice's random number
#b=randint(1,p) # Bob's random number
#x=q**a; y=q**b
#x; y; x**b; y**a

#x=findLargePrimitiveRoot(10**10,p)
#x
x=mod(Dirichlet(p),p)
x
#+END_SRC

#+RESULTS: Diffie-Hellman
: 729997630957051815181242080946878121063643194794671653097237700984266810608325417858611624412093730804217338385338030978454365100508284340524035090477
: 7
: 472020484402767
: 395319770560594
: 249234316520562
: 249234316520562
: 10000000001

*** In-Class Examples/Practice
#+NAME: Iterated Encryption
#+BEGIN_SRC sage

# RSA - Encryption Procedures=========
def rsaencrypt(Message, encrexp, encrmod, rounds):
    if (rounds <= 0): return Message
    A=Message
    E = power_mod(A,encrexp,encrmod);
    return rsaencrypt(E,encrexp,encrmod, rounds-1)
#=====================================

# Blackboard:LectureNotes:Lecture11:Example
# REMEMBER: E1=M^e mod n
# Where M-plaintext and E-ciphertext
# ^^ 1st encryption vv 2nd encryption
# E2=E1^e mod n

# Encryption Modulus:
n=315562173921131111550753275258954314886929684614433857059068225329589007516900986203500713113234143069878550293
# Encryption Exponent:
e=1835588100642725811278316299646156385857628660058608776628872255463681001129596115865795858135978837517124882698892069345209251312769967638417909171551219459094621692202465346003400944724101186482909006146466321559204641
# Ciphertext:
E=150598315159426420417362370315760759643687452249127260593893330249875774660837569082216166241764228321707042114

E=rsaencrypt(E,e,n,10)
E
#+END_SRC

#+RESULTS: Iterated Encryption
: 150598315159426420417362370315760759643687452249127260593893330249875774660837569082216166241764228321707042114

#+NAME: Hellman Pohlig Silver Attack
#+BEGIN_SRC sage
import itertools
def HPSonP (Generator, Target, P):
    Unknown = 0
    N = P - 1
    K = factor(N)
    K = list(K)
    #print K
    for pk in K:
        #print pk
        primes =pk[0]
        #Maple code to convert
        #primes = op(1, op(1, op(i, K)))
        #if len(K[i]) == 1:
        #if len(op(i, K)) == 1:
        #    powers = 1
        #else:
        #    powers = op(2, op(i, K))
        powers = pk[1]
        Z = N / primes
        chi = power_mod(int(Generator), int(Z),int(P))
        n = 0
        t = [0]*powers
        a = [0]*powers
        d = [0]*powers
        for j in xrange(0, powers):
            #print j
            if j == 0:
                a[j - 1] = Target
            else:
                Z2 = (d[j - 1 - 1] * power_mod(int(primes),int(j - 1),int(N))) % N
                Pt = power_mod(int(Generator), int(Z2),int(P))# % P
                a[j-1] = (a[j - 1 - 1] / Pt) % P
            y = Z / primes ** j
            t[j-1] = power_mod(int(a[j - 1]),int(y),int(P))# % P
            s = 1
            for k in itertools.count(1):
                #print "k",k
                if t[j - 1] == s:
                    d[j - 1] = k
                    break
                s = (s * chi) % P
            n = (n + d[j - 1] * primes ** j) % N
        NN = N / primes ** powers
        X = (1 / NN) % primes ** powers
        Unknown = (Unknown + NN * n * X) % N
    #unassign(t)
    return(Unknown)



def Dirichlet (q):
    j=0
    
    #for j in numpy.arange(0.10e1, infinity + 0.10e1, 0.10e1):
    while True:
        j+=1
        p = 2 * j * q + 1
        if is_prime(p) == True:
            return(p)
        
def findLargePrimitiveRoot(n,p):
    n=n+1
    eulerp = euler_phi(p)
    Q = list(factor(eulerp))
    while n<p:
        found = True
        for Q2 in Q:
            q=Q2[0]
            totest = power_mod(ZZ(n),ZZ(eulerp/q),ZZ(p)) 
#            print(totest)
            if totest==1:
                found = False
        if found:
            return n
        n+=1
		
#(1) Choose a large prime q
q=random_prime(10**15,10**20)
#(2) p=Dirichlet(q)
p=Dirichlet(q)
is_prime(p)
f=factor(p-1); f
#(3) Find primitive root of p
g=findLargePrimitiveRoot(random_prime(10**15,10**20),p); g
#(4) Choose
#  c0 < p1
#  c1 < p2
#  ...
#  ck = q-1
c=[1]
p=[]
for i in range(len(f)):
	c.append(f[i][0])
	p.append(f[i][0])

for i in p:
	print(i)
for i in c:
	print(i)
#crt(c,p)
#+END_SRC

#+RESULTS: Hellman Pohlig Silver Attack
#+begin_example
True
2^2 * 3 * 5 * 610459946299339
579995556223154
2
3
5
610459946299339
1
2
3
5
610459946299339
#+end_example

****** Part 2 - Sage Code
   #+NAME: Homework 7 (Common Encryption Exponent)
   #+HEADER: :tangle ./src/sage/commonEncryptionExponentHmwk7.sage
   #+BEGIN_SRC sage
   #################################################################################################
   # The input is a number and the output is the original message. If the input is not padded ASCII#
   # version of a message it returns the value: "This is not a padded ASCII string"                #
   #################################################################################################
   def ASCIIDepad(Number):
       ndigits=len(str(Number))
       n = ndigits % 3
       if (n > 0):
           print("This is not a padded ASCII string\n")
       else:
           L = [((Number - (Number % (1000^i)))/1000^i)%1000 - 100 for i in range(Number.ndigits()/3)]
           N = ""
           for i in range(Number.ndigits()/3):
               N = chr(L[i]) + N
           return(N)

   b=[
   17089298199140245689054146396696610382482599563869128220501355545433181167922449,
   647456570985467791350694143163125775416153692645317710289110387858313344490925,
   1571157443614188818570414758920219335869445581270513124197983268054945711653,
   8680494616758492300153857128626182886244875669712992627620622363379875255673298873890889, 
   3740176144174317705113182325751346003703203506734421120250951010374481407984708481673873
   ]
   # encryption canNOT be larger than the modulus
   n=[
   138167915492481816745409346812614907970213601388948993432404324912548722779337539,
   689234730968542058710415199123628060022111911748855188203650454001478717930441,
   165927789907443292785652054606917804467309174081946624778696246358960638705571,
   9707030033411217539906954498964338207893718488045203990403325340285676761140144260245667,
   9702513696679623002778707839853209062395283481756367743103770927153046936810417007760591
   ]

   e=5
   x = crt(b,n); x
   M=x.nth_root(e)
   M=ASCIIDepad(M); M
   #+END_SRC

   #+RESULTS: Homework 7 (Common Encryption Exponent)
   : 179702189046065030137840983877506282733808216772222487872385030013418159775151368010537808270369776111280249922696184622250812210618422156974500421843302635815511055022781078203555271102862470424542573876078160729973527171345068730365265430297970391004390643094550260335823552446001
   : 'Next hack DigiCrime'

**** Homework 9
#+NAME: El Gamal Security
#+HEADER: :tangle ./src/sage/hmwk9.sage
#+BEGIN_SRC sage

###########################
# RSA & EL GAMAL Functions#
###########################
def ASCIIPad(Message):
	K = (map(ord,reversed(Message)));    
	le= len(K);
	x = [100+K[i] for i in range(le)];
	x = ZZ(x,1000);
	return(x);
	
def ASCIIDepad(Number):
	n = Number.ndigits() % 3;
	if (n > 0):
		print("This is not a padded ASCII string\n");
	else:
		L = [((Number - (Number % (1000^i)))/1000^i)%1000 - 100 for i in range(Number.ndigits()/3)];
		N = "";
		for i in range(Number.ndigits()/3):
			N = chr(L[i]) + N;
		return(N)
		
def rsaencrypt(Message, encrexp, encrmod):
	A = ASCIIPad(Message);
	E = power_mod(A,encrexp,encrmod);
	return(E);

def rsadecrypt(encr,decrexp,encrmod):
	D = power_mod(encr,decrexp,encrmod);
	N = ASCIIDepad(D);
	return(N);

# key is: (p,g,b)
# M in this case is the ciphertext E
def egVerify(key, M, y, s):
	v1=(power_mod(y,s,key[0]) * power_mod(key[2],y,key[0])) % key[0]
	v2=power_mod(key[1],M,key[0])
	return v1==v2
	
def egSign(key, M, x):
	r = randint(1,key[0])
	while gcd(r,key[0]-1) != 1:
		r+=1
	#print("gcd(r:{},(p-1):{})={}".format(r,key[0]-1,gcd(r,key[0]-1)))
	y = power_mod(key[1],r,key[0])
	s = ((M-(x*y))/r) % (key[0]-1)
	return (y,s)
	
def isqrt(n):
    return int(floor(sqrt(n)))

def usqrt (n):
    ur = isqrt(n)
    if ur ** 2 < n:
        ur = ur + 1
    return(ur)

def FermatAttack (n, rounds):
	st = usqrt(n)
	for x in range(st, st + rounds + 1):
		#print (x-st)
		sq = x ** 2 - n
		y = isqrt(sq)
		if y ** 2 == sq: 
			print "Factor found in round {0}".format(x-st+1)
			return(x + y)
	print "No factor found in {0} rounds".format(rounds)
	return 0
###########################

# IMPORTANT!!
# RSA is used to encrypt the below messages, El Gamal to sign them
# Alice and Bob  are secretly sharing Alice's private El-Gamal key to maintain a covert channel of communication

##############################################
# Information given in assignment description#
##############################################
# RSA KEYS
# Alice's Key
rsa_akey={'n':11739085287969531650666764880307069646178466406116413,'e':29}
# Bob's key
rsa_bkey={'n':46956341151878126602666849327932976850293104473816077, 'e':71}
# Jack's key
rsa_jkey={'n':105651767591725784856000289747489691397274520258086741,'e':113}
# Lucy's key
rsa_lkey={'n':187825364607512506410666935319870481320981631530945317, 'e':173}
rsa_keys=[rsa_akey,rsa_bkey,rsa_jkey,rsa_lkey]

# El Gamal Keys
# Alice's Key
eg_akey={'p':11739085287969531650666764880307069646178466406133747, 'g':122 ,'b':4559251933765135908042850372269050947311088678478407}
# Bob's Key
eg_bkey={'p':46956341151878126602666849327932976850293104473818163, 'g':14646,'b':41773094887790182197984303656431777160492104718067730}
# Jack's Key
eg_jkey={'p':105651767591725784856000289747489691397274520258105207,'g':1771562,'b':77714098443250567285634413412177559464041605041509476}
# Lucy's key
eg_lkey={'p':187825364607512506410666935319870481320981631530959327,'g':214358883,'b':14644041014569643811484259591673998237151900979559891}
eg_keys=[eg_akey,eg_bkey,eg_jkey,eg_lkey]

# Alice's private El Gamal Key (x) - shared with bob for covert channel
eg_apkey=7699542093548349244049573757501851670562589091966419

# REVIEW EL GAMAL
# Public Key: (p,b,g) where p is a prime number, b=g^x mod p, g is a primitive root 1 < g < p of p
# Private Key: (x) x is a random number

# RSA Encrypted Message E | y=g^r mod p | s=(M-x*y)/r mod (p-1)
unknown1={'E':115251811749469530248002415406523254651489743459017725,'y':19240616197970611747502124859803652312085074442112010,'s':32706719515423467589632843847126484468195520962513517}
unknown2={'E':19659961695727243828141973694524447795978653272532149, 'y':50397128494149821593269937078000120329058172709578908,'s':47844269820223698406809962518912128051231159162499240}
unknown4={'E':126624117419296887665831621310305588878545225870594430,'y':9352666161952933766287125798193970300698629396417740,'s':4002797869345137661356168947662543489885815101905269}
unknown3={'E':1199064630279469528093193372862416429357320708704542,'y':105216848703587739343303886089914553038944537874501648,'s':139693573510952382531551260015801085872053556486585886}
unknowns=[unknown1,unknown2, unknown3, unknown4]

# Alice's message search
#print("Alice's Message Search Results")
rsa=(rsa_akey['n'],rsa_akey['e'])
eg=(eg_akey['p'],eg_akey['g'],eg_akey['b'])
x=eg_apkey

# El Gamal Signature Verification
M=ASCIIPad("Done!")
S=egVerify(eg,M,unknown4['y'],unknown4['s'])

# Fermat Attack Attempt
n=rsa[0]
e=rsa[1]
p=FermatAttack(n,10)
q=n/p
phi=(p-1)*(q-1)
d=inverse_mod(e, phi)

# Bob's message search
#print("Bob's Message Search Results")
rsa=(rsa_bkey['n'],rsa_bkey['e'])
eg=(eg_bkey['p'],eg_bkey['g'],eg_bkey['b'])

# Fermat Attack Attempt
n=rsa[0]
e=rsa[1]
p=FermatAttack(n,10)
q=n/p
phi=(p-1)*(q-1)
d=inverse_mod(e, phi)
bt=d
bn=n
M=rsadecrypt(unknown2['E'], d, n)
M=rsadecrypt(unknown3['E'], d, n)

# El Gamal Signature Verification
M=ASCIIPad("Buy IBM")
S=egVerify(eg,M,unknown1['y'],unknown1['s'])

# Jack's message search
#print("Jack's Message Search Results")
rsa=(rsa_jkey['n'],rsa_jkey['e'])
eg=(eg_jkey['p'],eg_jkey['g'],eg_jkey['b'])

# El Gamal Signature Verification
M=ASCIIPad("Sell AT&T")
S=egVerify(eg,M,unknown2['y'],unknown2['s'])

# Lucy's message search
#print("Lucy's Message Search Results")
rsa=(rsa_lkey['n'],rsa_lkey['e'])
eg=(eg_lkey['p'],eg_lkey['g'],eg_lkey['b'])

# El Gamal Signature Verification
M=ASCIIPad("Sell all")
S=egVerify(eg,M,unknown3['y'],unknown3['s'])

# Fermat Attack Attempt
n=rsa[0]
e=rsa[1]
p=FermatAttack(n,10)
q=n/p
phi=(p-1)*(q-1)
d=inverse_mod(e, phi)
M=rsadecrypt(unknown1['E'], d, n)
M=rsadecrypt(unknown4['E'], d, n)
############################################

# 1) Determine each Message
# 2) Determine For whom each message was intended
# 3) Determine from whom each message is, by verifying the corresponding El Gamal Signatures
oneThruThree="""
| Message     | To Whom                        | From Whom               |
|-------------+--------------------------------+-------------------------|
| Fermat      | Decrypted using private key of | verifying El Gamal Sigs |
|-------------+--------------------------------+-------------------------|
| "Buy IBM"   | Lucy                           | Bob                     |
| "Sell AT&T" | Bob                            | Jack                    |
| "Sell all"  | Bob                            | Lucy                    |
| "Done!"     | Lucy                           | Alice                   |
"""
# 4) Determine any messages Alice passed covertly to Bob through her El Gamal Signature
#M2=unknown1['E']
M2=ASCIIPad("Done!")
y=unknown4['y']
s=unknown4['s']
p=eg_akey['p']-1
D=((M2-(x*y))/s) % p
#D=rsadecrypt(D, bt, bn); D
D=ASCIIDepad(D); D
#+END_SRC

#+RESULTS: El Gamal Security
: Factor found in round 1
: Factor found in round 1
: Factor found in round 1
: 'Downsizing'

**** Homework 10
	 
#+BEGIN_EXAMPLE 
Part1 Prep

- Looked for common y to see if I could dicern the random number 'r', no common y's were found
- Used Initial Segment attack to find (p-1) of Alice's public EG key
- Attempted Fermat Attack for Lucy's public RSA key - Failed
- Attempted One Line factoring method to discover public RSA key - Success!
#+END_EXAMPLE

*USEFUL LINKS FOR REFERENCE*
[[https://blackboard.boisestate.edu/bbcswebdav/pid-5733616-dt-content-rid-30155838_1/courses/1189-70632MATH307001/CommonRendom%20Number.PDF][El Gamal Sig and Random Number Schema]]
[[https://blackboard.boisestate.edu/bbcswebdav/pid-5733616-dt-content-rid-30155832_1/courses/1189-70632MATH307001/Legendre%20Covert%20Channel.pdf][Legendre type covert Channel]]
[[https://share.cocalc.com/share/5350c8ff-68cc-42b4-921d-a5cbf8ba1ff2/Sage%20Files/ISAttack.sagews?viewer=share][IS attack code]]
[[https://share.cocalc.com/share/ace6d4f1-2ecc-4078-bce1-11b9bb02a0ac/LegendreCovertChannel.sagews?viewer=share][Legendre Code]]
[[https://share.cocalc.com/share/5350c8ff-68cc-42b4-921d-a5cbf8ba1ff2/Sage%20Files/Fermat%20Attack.sagews?viewer=share][Fermat Attack Code]]
[[https://share.cocalc.com/share/5350c8ff-68cc-42b4-921d-a5cbf8ba1ff2/Sage%20Files/RSA%20Encryption.sagews?viewer=share][RSA Encrypt code]]
[[https://share.cocalc.com/share/5350c8ff-68cc-42b4-921d-a5cbf8ba1ff2/Sage%20Files/RSA%20Decryption%20.sagews?viewer=share][RSA Decrypt code]]
#+NAME: Homework 10 Solutions (Legendre Function)
#+HEADER: :tangle ./src/sage/hmwk10/legendre.sage
#+BEGIN_SRC sage
######################
#Function definitions#
######################
def ASCIIDepad(Number):
    n = Number.ndigits() % 3;
    if (n > 0):
        print("This is not a padded ASCII string\n");
    else:
        L = [((Number - (Number % (1000^i)))/1000^i)%1000 - 100 for i in range(Number.ndigits()/3)];
        N = "";
        for i in range(Number.ndigits()/3):
            N = chr(L[i]) + N;
    return(N);

def ASCIIPad(Message):
    K = (map(ord,reversed(Message)));
    le= len(K);
    x = [100+K[i] for i in range(le)];
    x = ZZ(x,1000);
    return(x);

def rsadecrypt(encr,decrexp,encrmod):
    D = power_mod(encr,decrexp,encrmod);
    N = ASCIIDepad(D);
    return(N);

def rsaencrypt(Message, encrexp, encrmod):
    A = ASCIIPad(Message);
    E = power_mod(A,encrexp,encrmod);
    return(E);

def ISAttack (R):
    n = R.ndigits()
    for j in range(1, n + 1):
        x=(R-(R % 10^j))/10^j
        p = gcd(x, R)
        if ((1 < p)and (p<R)):
            return(p)
    print "nonefound"
	
def NewLegendre(a,p):
    if is_prime(p):
        return (1+kronecker(a,p))/2
    else:
        print "2nd argument has to be a prime"
        
def BlockNumber(y,primelist):
    m=0
    for i in xrange(0,4):
        m = 2*m + NewLegendre(y,primelist[i+10])
    return m+1

def BlockContents(y,primelist):
    k=0
    for i in xrange(0,10):
        k=10*k+NewLegendre(y,primelist[i])
    return k

def KeyDiscover(ylist,primelist):
    c=10^10
    k=0
    for i in xrange(16):
        d=16-BlockNumber(ylist[i],primelist)
        k=k+(BlockContents(ylist[i],primelist))*(c^d)
    return int(str(k),2)
	
def isquare (n):
    if isqrt(n) ** 2 == n:
        return(True)
    return(False)

def isqrt(n):
    return int(floor(sqrt(n)))

def usqrt (n):
    ur = isqrt(n)
    if ur ** 2 < n:
        ur = ur + 1
    return(ur)

def OneLine (n, iter):
    for x in range(1, iter + 1):
        sq = usqrt(x * n)
        y = sq ** 2 % n
        if isquare(y) == True:
            t = isqrt(y)
            u = gcd(n, sq - t)
            print("Factor found in round {0} rounds".format(x))
            return(u)
    print("No factors found")

# key is: (p,g,b)
# M in this case is the ciphertext E
def egVerify(key, M, y, s):
    v1=(power_mod(y,s,key[0]) * power_mod(key[2],y,key[0])) % key[0]
    v2=power_mod(key[1],M,key[0])
    return v1==v2
	
def egSign(key, M, x):
    r = randint(1,key[0])
    while gcd(r,key[0]-1) != 1:
        r+=1
	#print("gcd(r:{},(p-1):{})={}".format(r,key[0]-1,gcd(r,key[0]-1)))
    y = power_mod(key[1],r,key[0])
    s = ((M-(x*y))/r) % (key[0]-1)
    return (y,s)
	
#Finds random number used in El Gamal signature
# Remember
# r=(M2-x*y)/s mod (p-1) **gcd(s,p-1) must equal 1**
def rDiscover(M,x,y,s,p):
	if gcd(s,p-1) == 1:
		return ((M-x*y)/s) % (p-1)
	print("Value for 'r' Could not be found")
	return 0
######################

description="""
Foundations of Cryptology
Assignment 10
The OTB (Office of Technology Busting) made special purpose computer chips for generating
El-Gamal signatures and covertly planted in each chip *14 prime numbers* to leak the *160-bit private
key of the signer*, *10 bits per signature*. The *last four prime numbers* are used to code which of the
sixteen blocks of 10 bits each is being leaked by the particular signature, and primes 1 through ten
leak these ten bits prime 1 leaks bit 1, prime 2 leaks bit 2, and so on.
Alice bought one of these chips and installed it in her computer. Here are the 14 covert prime
numbers planted in her chip:"""

primelist=	[2610874309742867231360502542308382199053675592825240788613991898567287,
		6881793749340807728335795394301261629479870548736450984003401594706373,
		8314906195914825136973281314862289454100745237769034410057080703111511,
		5127114594552921209928891515242515620324828055912854227507525717981667,
		7473570262981491527797413449568788992987500442157627511097882499376811,
		9062890227065912603127119521589474574157513825150650905007553408748219,
		2815984929359632269852681585809504709739738485231104248045693804710167,
		8302655538010818866476054310788175542136407374106205605523687223947057,
		5812242019121022573901665288968349097396414947780422731613987785640429,
		4198272844134050365811754869582636140810856859347877704841433599229643,
		8724880795485531802023255050614524952922474293642065329619154912668053,
		6069438450681407641506962917791070874166946435905950292905549552889463,
		4125842236067060541266621757734462223575905687273574099511410424381497,
		9501247275887974857856234450269247606386273485070460241146322057229349]

description="""
Alice regularly corresponds with Lucy using the following protocol. They encrypt messages for
each other using the RSA crypto-system, and sign these messages using the El-Gamal system.
Lucy's RSA public key is as follows:"""
rsa_lkey={'n':1380329510951197510100010724038844435804781490991185453524669, 'e':431452543435309613375031056399003408107128387827408402715967, 't':0}
n=rsa_lkey['n']
e=rsa_lkey['e']
p=OneLine(n,10) # Private RSA key
q=n/p
phi=(p-1)*(q-1)
t=inverse_mod(e,phi)
rsa_lkey['t']=t; t

#Alice's El-Gamal signature key is as follows:
eg_akey={'p':10000000000000000000000000000000000000000000000000000000000000000005707, 'g':2, 'b':5829711445814756593150837441577049879646826835967016234521362166032923}
#p-1 == p
n=eg_akey['p']-1
p=ISAttack(n)
q=n/p

description="""
Here are sixteen messages from Alice to Lucy which have been collected by the Cyber Forensics
unit of the OTB: (E is the RSA - encrypted message, and y and s have their usual meanings in the
context of El-Gamal signatures: s is the result of signing the padded ASCII version of the message.)
"""

M1={'E':1134781463560674835061224378575070131233310977090840813092301,'y':6355654156581339292380028178295946379397857230419335473049773634105011, 's':9165085756767321557707624388546095482608475475072419124793930216287642}
M2={'E':348526314010735292619330553642899978920623570033772324649849,'y':6157738735079726271974947267390448530039834693941568486254984166399169, 's':7580596732923277682277308429550458486421120322969733810425808677713063}
M3={'E':144280751261655647389997303952062412262367552233518955034975,'y':9335313663168312334842734241780762294755281133475486862667663109265693, 's':902452660748342094448043076348013766357745134358961491151947971831298}
M4={'E':448648149210542717563843830926466689272194100737881817695849,'y':5666312454503499142803478855324287143700047631332918051757975784387852, 's':2339212545643638702289301089883628788751421175252652804149103380819500}
M5={'E':414463904058626538164714974954260575549577988440230717028375,'y':8609729555305475123927447895155480568383891784974360653476349663970219, 's':7542295030958909202194788901128163331877935875245454365944680358801016}
M6={'E':762798455103578108350927164584389075158784895748140579440858,'y':7365404439138911411864937298776875814102498525963049435105763372378772, 's':1606771469519514190569490683909892293358374332166482060564995247015982}
M7={'E':1176909860227801331876617938268884763814085436948672573185440,'y':5705440343386587753765002035968279773205391692599442025007820809081663, 's':795056909654530610475130199155990661441694481486389575943239181360163}
M8={'E':1038784868243291703163122137403638880051390504859030077046832,'y':9139181219517140532824520580591540432442737355121485514849816985670182, 's':718431597798222122752848311170876804983108930346831880471325577707750}
M9={'E':534307298423793561315454335890652994099216705910796252757003,'y':3851953190357247351746340095276683473382065321260493360272121028908078, 's':4425969620597187781028255597865205402426141520827972218693653450885014}
M10={'E':294792873244090595225360406826078427911073375481311873865117,'y':8332119728236605996252741802820164399490394892793656670206410123540806, 's':5683798202666903152470108694640039089754745733985049884601886790614149}
M11={'E':1355904422553023580096618287264066452910577884654954174043845,'y':1090916439028367923335435833686239225083325662650219511577614470087626, 's':3486112167704760872711104718953680515027994408104257306046727398596982}
M12={'E':528414128418567725915368190435344574500994961365177769853400,'y':4044337428348522271547535017777415980322724356426081427629324943634693, 's':1280391621642407995368091574204252749818718773673779092796712310184877}
M13={'E':382048408707112057090584331184203176355530469092303817253852,'y':5047503978916103346914776520107614498353295441864520623517103573476005, 's':6622497751951716014580838234980317172956294365936998965231635552650598}
M14={'E':1138109602667405943072422513690232405305131283131822608386662,'y':3079609686866100016134750688150613028636970390199280613932162055042282, 's':7651064433223341671855042720940102025407140854125385153059255930291852}
M15={'E':648551792358033195908225921930717188912777934403051076101283,'y':2507949926452818146783101167935559217583543852145717090862513023080430, 's':1876892947883839710552556001755856886960301874237874824837728826983258}
M16={'E':1108329618226979748565921595052080391831955721135843401833413,'y':1137237284834714268920432440084126521105380025168123492652543171722168, 's':4974270349376072715089518021560121124590346430908794289954437585093573}
M=[M1,M2,M3,M4,M5,M6,M7,M8,M9,M10,M11,M12,M13,M14,M15,M16]
y=[i['y'] for i in M]
s=[i['s'] for i in M]
E=[i['E'] for i in M]
p=primelist


#The following replicates info from Blackboard:Software:Legendre-CoCalc
#This discovers 'x'? - verify somehow
x=KeyDiscover(y,p); x # Takes about 20s to compute
#1290003348882681184907543014445365590610205625395L

#Example Usage of Block leakage
#BlockNumber(y[0],p) #Quick computation
#BlockContents(y[0],p)
#for i in range(16):
#	bc = BlockContents(y[i], p)
#	print (BlockNumber(y[i],p), bc)
	
# Decrypt messages sent to Lucy using Lucy's private key:
#for i in M:
#	mi=rsadecrypt(i['E'],rsa_lkey['t'], rsa_lkey['n']); mi

# Remember r = (M-x*y)/s mod (p-1); use rDiscover(M,x,y,s,p), to find each random number

#From this information determine:
#1. Lucy's private RSA key;
	#361305388410523
#2. Alice's private El-Gamal key;
	#x=1290003348882681184907543014445365590610205625395L
#3. All the messages from Alice to Lucy;
mes=[
	'Trust the OTB!',
	'I trust them.',
	'They make chips',
	'for signatures.',
	'Did you get it?',
	'I may visit.',
	'Perhaps not.',
	'Stay cool.',
	'Say nothing.',
	'Good move!',
	'Change keys.',
	'Bob cracked it',
	'Maybe also Jack',
	'Mine are safe.',
	'Uh-oh...',
	'They are not?']
#4. All the random numbers used by Alice during signature generation.
#rDiscover(M,x,y,s,p):
r=[]
for i in range(len(mes)):
	r.append(rDiscover(ASCIIPad(mes[i]), x, y[i],s[i], eg_akey['p']))
	print(str(i+1) + ". " + str(r[i]))
randomNumbers="""
1. 0
2. 279609980683956300275566144892650827765370570419
Value for 'r' Could not be found
3. 0
Value for 'r' Could not be found
4. 0
Value for 'r' Could not be found
5. 0
Value for 'r' Could not be found
6. 0
7. 561632179750555610745205884336981428558537921825
Value for 'r' Could not be found
8. 0
Value for 'r' Could not be found
9. 0
10. 660302497351884884272183075684764705268237246717
Value for 'r' Could not be found
11. 0
12. 424540208662980822891917406935720503852329046165
Value for 'r' Could not be found
13. 0
Value for 'r' Could not be found
14. 0
Value for 'r' Could not be found
15. 0
16. 1304740743478692639491729486909033636608504466639
"""
s=((ASCIIPad(mes[1])-x*y[1])/r[1]) % (eg_akey['p']-1); s #This is the correct 'r'
#+END_SRC

#+RESULTS: Homework 10 Solutions (Legendre Function)
#+begin_example
Factor found in round 3 rounds
361305388410523
1290003348882681184907543014445365590610205625395L
Value for 'r' Could not be found
1. 0
2. 279609980683956300275566144892650827765370570419
Value for 'r' Could not be found
3. 0
Value for 'r' Could not be found
4. 0
Value for 'r' Could not be found
5. 0
Value for 'r' Could not be found
6. 0
7. 561632179750555610745205884336981428558537921825
Value for 'r' Could not be found
8. 0
Value for 'r' Could not be found
9. 0
10. 660302497351884884272183075684764705268237246717
Value for 'r' Could not be found
11. 0
12. 424540208662980822891917406935720503852329046165
Value for 'r' Could not be found
13. 0
Value for 'r' Could not be found
14. 0
Value for 'r' Could not be found
15. 0
16. 1304740743478692639491729486909033636608504466639
7580596732923277682277308429550458486421120322969733810425808677713063
#+end_example

***** Notes
	  *I accidently deleted stuff...missing notes and files*
#+NAME: Function Pointers
#+HEADER: :dir ./src/c
#+HEADER: :file functionPointers.txt
#+HEADER: :tangle ./src/c/functionPointers.c
#+BEGIN_SRC C :includes '(<stdio.h> <stdlib.h>)
printf("Hello World");
#+END_SRC

#+RESULTS: Function Pointers
: DEBUG: Entering a string/function foo!

